backend-api/app/Controllers/AuthController.php

    public function login()
    {
        $db = \Config\Database::connect();
        $username = $this->request->getVar('username');
        $password = $this->request->getVar('password');

        $user = $db->table('users')->getWhere(['username' => $username])->getRow();

        if ($user && password_verify($password, $user->password)) {
            // Membuat secure token acak [cite: 34]
            $token = bin2hex(random_bytes(32));

            // Simpan token ke database
            $db->table('users')->where('id', $user->id)->update(['token' => $token]);
---
SELECT *
FROM `users`
WHERE `username` = 'admin'
UPDATE `users` SET `token` = '21d100311ca63708bac3d64b3ab77df3b8ea00632b5b63944be0a9c0e86bf2a1'
WHERE `id` = '1'

    public function logout()
    {
        $authHeader = $this->request->getServer('HTTP_AUTHORIZATION');
        if ($authHeader) {
            $token = explode(' ', $authHeader)[1] ?? '';
            $db = \Config\Database::connect();
            $db->table('users')->where('token', $token)->update(['token' => null]);
---
UPDATE `users` SET `token` = NULL
WHERE `token` = '21d100311ca63708bac3d64b3ab77df3b8ea00632b5b63944be0a9c0e86bf2a1'