backend-api/app/Controllers/BarangController.php

    public function index()
    {
        $db = \Config\Database::connect();
        $builder = $db->table('barang');
        $builder->select('barang.*, kategori.nama_kategori, supplier.nama_supplier as nama_supplier_rel, supplier.no_telp, supplier.email');
        $builder->join('kategori', 'kategori.id = barang.id_kategori');
        $builder->join('supplier', 'supplier.id = barang.id_supplier', 'left');
        $builder->orderBy('barang.id', 'DESC');
        return $this->respond($builder->get()->getResultArray(), 200);
---
SELECT `barang`.*, `kategori`.`nama_kategori`, `supplier`.`nama_supplier` as `nama_supplier_rel`, `supplier`.`no_telp`, `supplier`.`email`
FROM `barang`
JOIN `kategori` ON `kategori`.`id` = `barang`.`id_kategori`
LEFT JOIN `supplier` ON `supplier`.`id` = `barang`.`id_supplier`
ORDER BY `barang`.`id` DESC

    public function getKategori()
    {
        $db = \Config\Database::connect();
        return $this->respond($db->table('kategori')->get()->getResultArray(), 200);
---
SELECT *
FROM `kategori`

    public function update($id = null)
    {
        $db = \Config\Database::connect();
        $id_supplier = $this->request->getVar('id_supplier');
        $supplier = $id_supplier ? $db->table('supplier')->getWhere(['id' => $id_supplier])->getRow() : null;

        $data = [
            'id_kategori'  => $this->request->getVar('id_kategori'),
            'nama_barang'  => $this->request->getVar('nama_barang'),
            'stok'         => $this->request->getVar('stok'),
            'harga'        => $this->request->getVar('harga'),
            'supplier'     => $supplier ? $supplier->nama_supplier : $this->request->getVar('supplier'),
            'id_supplier'  => $id_supplier,
        ];
        $db->table('barang')->where('id', $id)->update($data);
---
SELECT *
FROM `supplier`
WHERE `id` = '2'
UPDATE `barang` SET `id_kategori` = '2', `nama_barang` = 'Kursi Kerja Ergonomis', `stok` = '40', `harga` = 1199999, `supplier` = 'CV. Indofurniture', `id_supplier` = '2'
WHERE `id` = '2'