backend-api/app/Controllers/HistoriController.php

SELECT `histori_barang`.*, `barang`.`nama_barang`, `barang`.`supplier`
FROM `histori_barang`
JOIN `barang` ON `barang`.`id` = `histori_barang`.`id_barang`
ORDER BY `histori_barang`.`id` DESC
---
    public function index()
    {
        $db = \Config\Database::connect();
        $builder = $db->table('histori_barang');
        $builder->select('histori_barang.*, barang.nama_barang, barang.supplier');
        $builder->join('barang', 'barang.id = histori_barang.id_barang');
        $builder->orderBy('histori_barang.id', 'DESC');
        $query = $builder->get();