backend-api/app/Controllers/SupplierController.php

    public function index()
    {
        $db = \Config\Database::connect();
        $data = $db->table('supplier')->orderBy('id', 'DESC')->get()->getResultArray();
---
SELECT *
FROM `supplier`
ORDER BY `id` DESC

    public function create()
    {
        $db = \Config\Database::connect();
        $data = [
            'nama_supplier' => $this->request->getVar('nama_supplier'),
            'alamat'        => $this->request->getVar('alamat'),
            'no_telp'       => $this->request->getVar('no_telp'),
            'email'         => $this->request->getVar('email'),
        ];
        if (empty($data['nama_supplier'])) {
            return $this->fail(['status' => 400, 'error' => 'Nama supplier wajib diisi'], 400);
        }
        $db->table('supplier')->insert($data);
---
INSERT INTO `supplier` (`nama_supplier`, `alamat`, `no_telp`, `email`) VALUES ('pt mandiri', 'kp cibodas', '0986556756', 'ptmandiri@gmail.com')