backend-api/app/Filters/AuthFilter.php

SELECT *
FROM `users`
WHERE `token` = 'c3fa3fce6c33583c9eb0c0c3ec90c72d5ab34631e7de260d963cf472fb32bdd2'
---
    public function before(RequestInterface $request, $arguments = null)
    {
        $authHeader = $request->getServer('HTTP_AUTHORIZATION');

        if (!$authHeader) {
            return Services::response()
                ->setJSON(['status' => 401, 'error' => 'Akses ditolak. Token tidak ditemukan.'])
                ->setStatusCode(401);
        }

        // Memecah string "Bearer <token>"
        $tokenArray = explode(' ', $authHeader);
        $token = $tokenArray[1] ?? '';

        $db = \Config\Database::connect();
        $user = $db->table('users')->getWhere(['token' => $token])->getRow();